app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function loginProcess()
    {
        $session = session();
        $model = new UserModel();

        $identifier = $this->request->getPost('identifier');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $identifier)->first();