app/Controllers/Auth.php

INSERT INTO `users` (`username`, `email`, `password`, `role`) VALUES ('Admin', 'admin@gmail.com', '$2y$10$0y.YsZT140zImpVWHKA1aeJzc8ed5IxR4bpUGEejen3r7kDiLGkK.', 'pengguna')
---
    public function saveRegister()
    {
        $userModel = new UserModel();

        $data = [
            'username' => $this->request->getPost('username'),
            'email'    => $this->request->getPost('email'),
            'password' => password_hash(
                $this->request->getPost('password'),
                PASSWORD_DEFAULT
            ),
            'role'     => $this->request->getPost('role'),
        ];

        if (!$userModel->insert($data)) {

SELECT *
FROM `users`
WHERE `email` = 'Admin'
OR `username` = 'Admin'
 LIMIT 1
---
    public function loginProcess()
    {
        $session = session();
        $model   = new UserModel();

        $identifier = trim($this->request->getPost('identifier'));
        $password   = trim($this->request->getPost('password'));

        $user = $model->where('email', $identifier)
                      ->orWhere('username', $identifier)
                      ->first();

SELECT *
FROM `users`
WHERE `users`.`id_user` = '11'
---
    public function editProfile()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $user = (new UserModel())->find(session('id_user'));