app/Controllers/Pages.php

SELECT *
FROM `services`
WHERE `id_penyedia` = '12'
---
    public function dashboardJasa()
    {
        helper('text');
        $session = session();
        $idPenyedia = $session->get('id_user');

        $services = $this->serviceModel
            ->where('id_penyedia', $idPenyedia)
            ->findAll();

UPDATE `services` SET `judul_jasa` = 'wowok02', `kategori` = 'Project Management', `deskripsi_jasa` = 'aku cinta sawit', `gambar_layanan` = '1767529719_105fd6bd2072d083d688.png'
WHERE `services`.`id_service` IN ('10')
---
            $data['gambar_layanan'] = $namaGambar;
        }

        $this->serviceModel->update($id, $data);