app/Controllers/Pages.php

    public function dashboardJasa()
    {
        $session = session();
        $idPenyedia = $session->get('id_user');

        if (!$idPenyedia) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu');
        }

        // Fetch services with analytics in single query
        $services = $this->serviceModel
            ->select('services.*, COALESCE(analytics.jumlah_dilihat, 0) as views, COALESCE(analytics.jumlah_pesanan, 0) as orders')
            ->join('analytics', 'analytics.id_service = services.id_service', 'left')
            ->where('services.id_penyedia', $idPenyedia)
            ->orderBy('services.id_service', 'DESC')
            ->findAll();

        $data = [
            'user' => [
                'username' => $session->get('username'),
                'email' => $session->get('email'),
                'role' => $session->get('role'),
            ],
            'services' => $services
        ];
---
SELECT `services`.*, COALESCE(analytics.jumlah_dilihat, 0) as views, COALESCE(analytics.jumlah_pesanan, 0) as orders
FROM `services`
LEFT JOIN `analytics` ON `analytics`.`id_service` = `services`.`id_service`
WHERE `services`.`id_penyedia` = '12'
ORDER BY `services`.`id_service` DESC
SELECT *
FROM `services`
WHERE `services`.`id_service` = '10'